#####Creating DataFrames

In [2]:
# Create a DataFrame
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [3]:
# Create a 3 point series with an index
ser01 = Series([100,200,300],
                 index=['A','B','C'])
# Show
ser01

A    100
B    200
C    300
dtype: int64

In [4]:
# Create a DataFrame by passing series
df01 = pd.DataFrame(ser01)
df01

     0
A  100
B  200
C  300

In [5]:
# Create a dataframe from scratch using a dictionary
data = {'State':['CA','CA','PA'],
        'City':['SF','LA','PHI'],
        'Airport':['SFO','LAX','PHL'],
        'Population':[837000,3880000,8400000]}

df02 = DataFrame(data)

#Show
df02

  Airport City  Population State
0     SFO   SF      837000    CA
1     LAX   LA     3880000    CA
2     PHL  PHI     8400000    PA

#####Selecting Columns and Rows

In [6]:
# Select column
df02['State']

0    CA
1    CA
2    PA
Name: State, dtype: object

In [7]:
# Grab multiple columns
# This creates a new data frame
DataFrame(df02,
          columns=['City','State'])

  City State
0   SF    CA
1   LA    CA
2  PHI    PA

In [33]:
# Or use
df02[['City','State']]

  City State
0   SF    CA
1   LA    CA
2  PHI    PA

In [38]:
# Select a row by index/label
df02.ix[1]

Airport           LAX
City               LA
Population    3880000
State              CA
Name: 1, dtype: object

In [34]:
# Or use
df02.iloc[1]

Airport           LAX
City               LA
Population    3880000
State              CA
Name: 1, dtype: object

In [9]:
# Show first row only
df02.head(1)

  Airport City  Population State
0     SFO   SF      837000    CA

In [10]:
# Show last row only
df02.tail(1)

  Airport City  Population State
2     PHL  PHI     8400000    PA

In [39]:
# Show df02
df02

  Airport City  Population State
0     SFO   SF      837000    CA
1     LAX   LA     3880000    CA
2     PHL  PHI     8400000    PA

In [42]:
# Grab rows using boolean logic
# Grab every row where Population > 1m
df02[df02['Population']>1000000]

  Airport City  Population State
1     LAX   LA     3880000    CA
2     PHL  PHI     8400000    PA

In [45]:
# Grab rows from a single column based on a value
# Grab every row where State = CA
# df[df['colume_name']==some_value]
df02[df02['State']=='CA']

  Airport City  Population State
0     SFO   SF      837000    CA
1     LAX   LA     3880000    CA

In [47]:
# Grab rows from multiple columns based on values
# Grab every row where State = CA AND PA
# (df.loc[df['B'].isin(['one','three'])])
df02[df02['State'].isin(['CA','PA'])]

  Airport City  Population State
0     SFO   SF      837000    CA
1     LAX   LA     3880000    CA
2     PHL  PHI     8400000    PA

#####Show Summary Statistics

In [11]:
# Show summary statistics
df02.describe()

           Population
count        3.000000
mean   4372333.333333
std    3805461.382452
min     837000.000000
25%    2358500.000000
50%    3880000.000000
75%    6140000.000000
max    8400000.000000

#####Transpose DataFrame

In [12]:
# Transpose DataFrame
df02.T

                 0        1        2
Airport        SFO      LAX      PHL
City            SF       LA      PHI
Population  837000  3880000  8400000
State           CA       CA       PA

#####Sort DataFrame

In [13]:
# Show DataFrame
df02

  Airport City  Population State
0     SFO   SF      837000    CA
1     LAX   LA     3880000    CA
2     PHL  PHI     8400000    PA

In [14]:
# Sort ascending by axis (Column Headers)
df02.sort_index(axis=1, ascending=True)

  Airport City  Population State
0     SFO   SF      837000    CA
1     LAX   LA     3880000    CA
2     PHL  PHI     8400000    PA

In [15]:
# Sort descending by axis (Column Headers)
df02.sort_index(axis=1, ascending=False)

  State  Population City Airport
0    CA      837000   SF     SFO
1    CA     3880000   LA     LAX
2    PA     8400000  PHI     PHL

In [16]:
# Sort ascending by axis (Row Index)
df02.sort_index(axis=0, ascending=True)

  Airport City  Population State
0     SFO   SF      837000    CA
1     LAX   LA     3880000    CA
2     PHL  PHI     8400000    PA

In [17]:
# Sort descending by axis (Row Index)
df02.sort_index(axis=0, ascending=False)

  Airport City  Population State
2     PHL  PHI     8400000    PA
1     LAX   LA     3880000    CA
0     SFO   SF      837000    CA

In [18]:
# Sort by Values - Airport
df02.sort(columns='Airport')

  Airport City  Population State
1     LAX   LA     3880000    CA
2     PHL  PHI     8400000    PA
0     SFO   SF      837000    CA

In [19]:
# Sort by Values - Population
df02.sort(columns='Population')

  Airport City  Population State
0     SFO   SF      837000    CA
1     LAX   LA     3880000    CA
2     PHL  PHI     8400000    PA

##### Dropping rows and Columns

In [20]:
# Show df02
df02

  Airport City  Population State
0     SFO   SF      837000    CA
1     LAX   LA     3880000    CA
2     PHL  PHI     8400000    PA

In [24]:
# Drop row index 1
df02.drop(1)

  Airport City  Population State
0     SFO   SF      837000    CA
2     PHL  PHI     8400000    PA

In [25]:
#Show df02
df02

  Airport City  Population State
0     SFO   SF      837000    CA
1     LAX   LA     3880000    CA
2     PHL  PHI     8400000    PA

In [27]:
# Drop City column
df02.drop('City',axis=1)

  Airport  Population State
0     SFO      837000    CA
1     LAX     3880000    CA
2     PHL     8400000    PA

##### Changing Values in a Data Frame

In [51]:
# Change a value in a dataframe
# Use set_value
df02.set_value(0, 'State', 'PA')

  Airport City  Population State
0     SFO   SF      837000    PA
1     LAX   LA     3880000    CA
2     PHL  PHI     8400000    PA

In [52]:
df02

  Airport City  Population State
0     SFO   SF      837000    PA
1     LAX   LA     3880000    CA
2     PHL  PHI     8400000    PA

In [53]:
# Change back to CA
df02.set_value(0, 'State', 'CA')

  Airport City  Population State
0     SFO   SF      837000    CA
1     LAX   LA     3880000    CA
2     PHL  PHI     8400000    PA

##### Perform Maths on DataFrame

In [59]:
# Create a dataframe from an array
arr0001 = np.array([[1,2,np.nan],
                    [np.nan,3,4]])
# Show
arr0001

array([[  1.,   2.,  nan],
       [ nan,   3.,   4.]])

In [60]:
# Create data frame
# Pass the matrix arr just created
# Show data frame
dfr0001 = DataFrame(arr0001,
                    index=['A','B'],
                    columns=['One','Two','Three'])
dfr0001

   One  Two  Three
A    1    2    NaN
B  NaN    3      4

In [61]:
# Sum values of dataframe
dfr0001.sum()

One      1
Two      5
Three    4
dtype: float64

In [62]:
# Sum rows
dfr0001.sum(axis=1)

A    3
B    7
dtype: float64

In [63]:
# Find minimum values in each column
dfr0001.min()

One      1
Two      2
Three    4
dtype: float64

In [64]:
dfr0001.idxmin()

One      A
Two      A
Three    B
dtype: object

In [67]:
# Show
dfr0001

   One  Two  Three
A    1    2    NaN
B  NaN    3      4

In [68]:
# Perform summary stats
dfr0001.describe()

       One       Two  Three
count    1  2.000000      1
mean     1  2.500000      4
std    NaN  0.707107    NaN
min      1  2.000000      4
25%      1  2.250000      4
50%      1  2.500000      4
75%      1  2.750000      4
max      1  3.000000      4

##### Missing Data

In [75]:
dfr0002 = DataFrame([[1,2,3],
                     [np.nan,5,6],
                     [7,np.nan,9],
                     [np.nan,np.nan,np.nan]],
                    index=['R1','R2','R3','R4'],
                    columns=['C1','C2','C3'])
dfr0002

    C1  C2  C3
R1   1   2   3
R2 NaN   5   6
R3   7 NaN   9
R4 NaN NaN NaN

In [76]:
# Can specify to drop rows if all values are null
# Show dframe
dfr0002.dropna(how='all')

    C1  C2  C3
R1   1   2   3
R2 NaN   5   6
R3   7 NaN   9

In [78]:
# show df
dfr0002

    C1  C2  C3
R1   1   2   3
R2 NaN   5   6
R3   7 NaN   9
R4 NaN NaN NaN

In [80]:
# Drop all columns that contain a NULL
dfr0002.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [R1, R2, R3, R4]

In [81]:
# Show dfr
dfr0002

    C1  C2  C3
R1   1   2   3
R2 NaN   5   6
R3   7 NaN   9
R4 NaN NaN NaN

In [82]:
# Can fill null values with a value
# Instead of dropping them
dfr0002.fillna(1)

    C1  C2  C3
R1   1   2   3
R2   1   5   6
R3   7   1   9
R4   1   1   1

In [83]:
# Show dfr
dfr0002

    C1  C2  C3
R1   1   2   3
R2 NaN   5   6
R3   7 NaN   9
R4 NaN NaN NaN

In [86]:
# Permanently fill the missing values instead of using a view
dfr0002=dfr0002.fillna(1)

In [87]:
# Show dfr
dfr0002

    C1  C2  C3
R1   1   2   3
R2   1   5   6
R3   7   1   9
R4   1   1   1

In [95]:
# Create a dataframe from an array
arr0002 = np.array([[1,2,np.nan],
                    [np.nan,3,4]])
# Show
arr0002

array([[  1.,   2.,  nan],
       [ nan,   3.,   4.]])

In [96]:
# Create data frame
# Pass the matrix arr just created
# Show data frame
dfr0004 = DataFrame(arr0002,
                    index=['A','B'],
                    columns=['One','Two','Three'])
dfr0004

   One  Two  Three
A    1    2    NaN
B  NaN    3      4

In [100]:
dfr0002.fillna(0,inplace=True)
dfr0002

    C1  C2  C3
R1   1   2   3
R2   1   5   6
R3   7   1   9
R4   1   1   1